import React, { Component } from "react";
import styles from "./index.module.css";

// Import assets
import MinisterImg from "../../../asset/about/ministerImg.jpg";

export class index extends Component {
  render() {
    return (
      <div className={styles.welcomeMessage}>
        <div className={styles.contentHeader}>
          <p className="m-0">សារស្វាគមន៏</p>
        </div>
        <div className={styles.contentBody}>
          <div className={styles.contentImg}>
            <img
              src={MinisterImg}
              alt=""
              style={{ width: "100%", height: "100%" }}
            />
          </div>
          <div className="content-text">
            <p>
              តាងនាម ក្រុមប្រឹក្សាខេត្តត្បូងឃ្មុំ
              ខ្ញុំសូមសំដែងនូវការស្វាគមន៍ចំពោះបងប្អូន
              ប្រជាពលរដ្ឋទាំងក្នុងប្រទេសនិងក្រៅប្រទេសដែលបានឆ្លៀតពេលវេលាដ៏មានតម្លៃ
              និងមមាញឹក ចូលមកតាមដានរាល់ព័ត៌មាននិងសកម្មភាពការងាររបស់ថ្នាក់ដឹកនាំ។
              ក្នុងសម័យកាលសកលភាវូបនីយកម្មនៃបច្ចេកវិទ្យាទំនើបនេះ ប្រជាពលរដ្ឋ
              គ្រប់រូបត្រូវពង្រឹងសមត្ថភាព ចំណេះដឹង ជំនាញ ប្រកបដោយគុណវុឌ្ឍ
              ដើម្បីចូលរួមចំណែកដល់ដំណើរការអភិវឌ្ឍន៍សេដ្ឋកិច្ចប្រទេសជាតិ។ ជាពិសេស
              ការយល់ដឹងអំពីការប្រើប្រាស់បណ្តាញសង្គម និងការទទួលបានព័ត៌មានពិត
              ព័ត៌មានទាន់ហេតុការណ៍ និងព័ត៌មានដែលឆ្លុះបញ្ចាំងដល់ទិដ្ឋភាព
              ជាក់ស្តែងនៃការរស់នៅប្រចាំថ្ងៃរបស់ខ្លួន។
            </p>
            <p>
              ដើម្បីគាំទ្រ និងចូលរួមអនុវត្តគោលនយោបាយយុទ្ធសាស្ត្រចតុកោណ
              ដំណាក់កាលទី៣
              និងធានាដល់ការធ្វើកំណែទម្រង់រដ្ឋស៊ីជម្រៅរបស់រាជរដ្ឋាភិបាលកម្ពុជា
              រដ្ឋបាលខេត្ត បានសម្រេចបង្កើតវេបសាយ (Wedsite)
              សំដៅលើកកម្ពស់ការផ្សព្វផ្សាយព័ត៌មាន សេចក្តីជូនដំណឹង
              ព្រឹត្តិការណ៍ផ្សេងៗ និងសកម្មភាពនានារបស់ថ្នាក់ដឹកនាំ
              ព្រមទាំងបង្កើនប្រសិទ្ធភាពក្នុងការផ្តល់សេវារដ្ឋបាល និងសេវាសាធារណៈ
              ប្រកបដោយតម្លាភាព គណនេយ្យភាព និងភាពសក្តិសិទ្ធិ ឆ្លើយតបទាន់ពេលវេលា
              រាល់តម្រូវការ បញ្ហាប្រឈម និងសំណូមពរ របស់ប្រជាពលរដ្ឋនៅតាមមូលដ្ឋាន។
            </p>
            <p>
              ជាមួយគ្នានេះ ខ្ញុំសូមអំពាវនាវដល់ប្រជាពលរដ្ឋទូទាំងខេត្ត
              មេត្តាធ្វើការទំនាក់ទំនងមកកាន់ក្រុមការងាររដ្ឋបាលខេត្តត្បូងឃ្មុំ
              តាមរយៈ លេខទូរស័ព្ទទំនាក់ទំនងក្នុងវេបសាយ (Wedsite) នេះ គ្រប់២៤ម៉ោង
              ដើម្បីទទួលបានព័ត៌មានពិតប្រាកដ គ្រប់ជ្រុងជ្រោយ
              និងស្របតាមតម្រូវការជាក់ស្តែង។
            </p>
            <p>
              ខ្ញុំសូមគោរពជូនពរ បងប្អូនប្រជាពលរដ្ឋទាំងអស់
              សូមទទួលបាននូវសុខភាពល្អបរិបូណ៍ ជន្មាយុយឺនយូរ
              និងជោគជ័យគ្រប់ភារកិច្ចការងារ។ សូមអគុណ
            </p>
          </div>
        </div>
      </div>
    );
  }
}

export default index;
